import json

student_data = {
    "Шевченко": ["Тарас", "Григорович", 1814],
    "Франко": ["Іван", "Якович", 1856],
    "Косач-Квітка": ["Лариса", "Петрівна", 1871],
    "Сковорода": ["Григорій", "Савич", 1722],
    "Хмельницький": ["Богдан", "Михайлович", 1595],
    "Корольов": ["Сергій", "Павлович", 1907],
    "Довженко": ["Олександр", "Петрович", 1894],
    "Вернадський": ["Володимир", "Іванович", 1863],
    "Амосов": ["Микола", "Михайлович", 1913],
    "Ступка": ["Богдан", "Сильвестрович", 1941]
}

file_name = 'people.json'

with open(file_name, 'w', encoding='utf-8') as f:
    json.dump(student_data, f, ensure_ascii=False, indent=4)

print(f"Дані успішно записано у файл '{file_name}'")
print(f"Перевірте файл '{file_name}' у вашому текстовому редакторі.")